<template>
  <section>
    <div class="container">
      <div class="jshop jshopcontent" id="comjshop">
        <h1>Официальное уведомление</h1>
        <p>
          <b>Договор купли-продажи в Интернет-магазине www.autosecurity.kz</b>
        </p>
        <p>
          Настоящий «Договор купли-продажи» (далее «Договор») определяет
          взаимоотношения между ИП «Auto Security Service», именуемым в
          дальнейшем «Продавец», в лице директора, действующего на основании
          Устава, с одной стороны, и «Покупателем» (физическим или юридическим
          лицом), принявшим публичное предложение (оферту) о заключении
          Договора.
        </p>
        <p>
          <b>1. Определения</b>
        </p>
        <p>
          1.1. Покупатель - физическое или юридическое лицо, размещающее Заказы
          на сайте www.autosecurity.kz, либо указанное в качестве получателя
          Товара.<br />1.2. Продавец - ИП "Auto Security Service", расположенный
          по адресу: Казахстан, г.Алматы, ул.Щепеткова,122.<br />1.3.
          Интернет-магазин - Интернет-сайт, расположенный на сервере в
          Российской Федерации и имеющий адрес в сети Интернет
          www.autosecurity.kz, на котором представлены товары, предлагаемые
          Покупателям для оформления Заказов, а также условия оплаты и доставки
          этих Заказов Покупателям.<br />1.4. Сайт - www.autosecurity.kz.<br />1.5.
          Товар – автоэлектроника и другая продукция, представленная к продаже
          на Сайте.<br />1.6. Заказ - должным образом оформленная заявка
          Покупателя на приобретение перечня Товаров, размещенная Покупателем
          самостоятельно на Сайте или по телефону.<br />1.7. on-line – способ
          оплаты Товаров через Kaspi.kz непосредственно при оформлении Заказа.
        </p>
        <p>
          <b>2. Предмет Договора</b><br /><br />2.1. Продавец поставляет и
          передает, а Покупатель оплачивает и получает Товары согласно
          размещенному Заказу.<br />2.2. Доставка Товара осуществляется по
          г.Алматы и в пределах 30 км от административных границ г. Алматы,
          стоимость оплаты за доставку Товара указана в ст.7 Договора.
        </p>
        <p>
          <b>3. Порядок заключения Договора и изменения его условий</b
          ><br /><br />3.1. Настоящий Договор является публичным Договором в
          соответствии с Гражданским кодексом Республики Казахстан, т.е. цена
          Товаров и другие условия Договора одинаковы для всех Покупателей.<br />3.2.
          Продавец оставляет за собой право вносить изменения в условия
          настоящего Договора.<br />3.3. Проведение Покупателем оплаты в
          соответствии с условиями настоящего Договора свидетельствует о
          заключении Договора со стороны Покупателя.
        </p>
        <p>
          <b>4. Общие положения</b><br /><br />4.1. Все информационные
          материалы, представленные на Сайте, носят справочный характер и не
          могут в полной мере передавать достоверную информацию о свойствах и
          характеристиках Товара, включая цвет, размеры и формы. В случае
          возникновения у Покупателя вопросов, касающихся свойств и
          характеристик Товара, перед оформлением Заказа, Покупатель может
          обратиться в CALL CENTER Продавца по тел. +7 707 747 8212, кроме
          субботы.<br />4.2. Заказ Покупателя может быть оформлен по телефону
          или через сеть Интернет.<br />4.2.1. При оформлении Заказа по телефону
          Покупатель подтверждает, что ознакомлен с правилами продажи Товаров
          через Интернет-магазин и предоставляет сотруднику CALL CENTER Продавца
          информацию, необходимую для оформления Заказа.<br />4.2.2. При
          оформлении Заказа через сеть Интернет Покупатель заполняет электронную
          форму Заказа на Товар и отправляет сформированный Заказ Продавцу
          посредством сети Интернет.<br />4.3. Оформление Покупателем Заказа и
          дальнейшая передача его к исполнению, означает достаточное и полное
          ознакомление Покупателя с Товаром, с информацией о цене, о наличии или
          отсутствии скидок на Товар.<br />4.4. Для подтверждения сделанного
          Заказа и оформления заявки на доставку Товара оператор CALL CENTER
          Продавца связывается с Покупателем по телефону, указанному Покупателем
          в Заказе.<br />4.5. В случае отсутствия заказанных Товаров на складе,
          Продавец вправе исключить указанный Товар из Заказа Покупателя и
          уведомить об этом Покупателя путем направления электронного сообщения
          по адресу либо по телефону, указанному при формировании Покупателем
          Заказа.<br />4.6. Доставка заказанного Товара Покупателю
          осуществляется по согласованию с Покупателем в определенный день по
          адресу, указанному Покупателем. Срок доставки Товара указан в п.7.1.
          Договора. Служба доставки Продавца работает с воскресенья по пятницу,
          выходной - суббота. При получении Товара Клиенту необходимо предъявить
          документ, удостоверяющий его личность. Если получателем Заказа
          выступает юридическое лицо, для получения Товара необходима
          доверенность от организации-плательщика, оформленная надлежащим
          образом.<br />4.7. Заказ считается исполненным в момент фактической
          передачи Покупателю Товаров, входящих в состав Заказа на основании
          выданных службой доставки Продавца сопроводительных документов на
          Товары под роспись Покупателя.<br />4.8. Право собственности на Товар
          и связанные с ним риски переходит от Продавца к Покупателю в момент
          приёмки Товара Покупателем и подписания сторонами сопроводительных
          документов.<br />4.9. На каждую единицу товара заполняется гарантийный
          талон с проставлением печатей Продавца. Срок и условия гарантии
          определяются гарантийным талоном. В случае обнаружения в течение
          гарантийного срока недостатков Товара, Покупатель обращается в
          авторизованный сервисный центр по телефонам и адресам, указанным в
          гарантийном талоне.
        </p>
        <p>
          <b>5. Права и обязанности сторон</b><br /><br />5.1 Продавец
          обязан:<br />5.1.1. Поставить Товар в соответствии с условиями
          Заказа.<br />5.1.2. Гарантировать соответствие качества Товара
          требованиям для аналогичных Товаров на территории РК.<br />5.1.3. В
          случае изменения срока доставки, немедленно информировать Покупателя
          об изменении условий доставки с целью получения согласия на новые
          условия выполнения Заказа в целом, либо в части. Продавец информирует
          Покупателя посредством телефонной либо электронной связи.<br />5.1.4.
          Рассматривать претензии и заявления Покупателей в соответствии с
          действующим законодательством РК и принимать меры к их
          удовлетворению.<br />5.2 Продавец имеет право осуществить действия в
          соответствии с п.10.7 и п.10.8. настоящего Договора.<br />5.3
          Покупатель обязан:<br />5.3.1. Предоставлять при оформлении Заказа
          точное наименование требуемого Товара, его номер по каталогу
          производителя или все данные необходимые для точного определения
          требуемого Товара (цвет, вариант исполнения).<br />5.3.2. Оплачивать
          Товар согласно Заказам по ценам, указанным на сайте.<br />5.3.3. При
          оформлении Заказа предоставлять о себе достоверную и достаточную
          информацию, в соответствии с бланком Заказа.<br />5.4 Покупатель имеет
          право:<br />5.4.1. Потребовать возврата предоплаты в случае
          невозможности исполнения Продавцом условий Заказа с учетом п.10.6.
          Договора.<br />5.4.2. Внести изменения в Заказ до начала его
          исполнения Продавцом.<br />5.4.3. До передачи ему Товара отказаться от
          исполнения Договора при условии возмещения Продавцу транспортных
          расходов, понесенных Продавцом в связи с совершением действий по
          выполнению настоящего Договора.
        </p>
        <p>
          <b>6. Цена и порядок оплаты</b><br /><br />6.1. Цена Товара
          указывается в каталоге Сайта. В случае неверного указания Продавцом
          цены заказанного Покупателем Товара, Продавец при первой возможности
          информирует об этом Покупателя для подтверждения либо аннулирования
          Заказа. При невозможности связаться с Покупателем данный Заказ
          считается аннулированным.<br />6.2. Цена Товара на Сайте может быть
          изменена Продавцом в одностороннем порядке. При этом цена на Товар,
          заказанный Покупателем и подтвержденный Продавцом изменению не
          подлежит.<br />6.3. Оплата Заказа производится Покупателем в тенге.<br />6.4.
          Оплата производится нижеперечисленными способами:<br />6.4.1. за
          наличный расчет представителю службы доставки Продавца;<br />6.4.2.
          безналичным путем через сервис Kaspi.kz.<br /><br />
        </p>
        <p>
          <b>7. Доставка Товаров</b><br /><br />7.1. Стоимость доставки
          выбранных Покупателем Товаров на общую сумму до 40.000 тг в пределах
          административных границ г.Алматы составляет 2000 тг.<br />7.2.&nbsp;Доставка
          выбранных Покупателем Товаров при превышении суммы заказа в 40.000 тг
          в пределах административных границ г.Алматы осуществляется
          бесплатно.<br />7.3.&nbsp;Стоимость доплаты за доставку Товара в
          пределах 30 (тридцати) км от административных границ г. Алматы
          составляет от 2000 тг и выше.<br />7.4. Точная стоимость доставки
          товара далее 30 (тридцати) км от административных границ г.Алматы
          уточняется у Продавца.<br />7.5. Доставка товаров из одного города в
          другой не осуществляется.<br />7.6. Покупатель может получить свой
          Товар самостоятельно в магазине, расположенном по адресу: г.Алматы,
          Щепеткова, 122, предъявив документ, удостоверяющий его личность, а
          также:<br />7.6.1 в случае оплаты через сервис Kaspi.kz предоставить
          Продавцу подтверждение произведенной оплаты, назвав номер, дату и
          сумму Заказа.<br />7.6.2 при оплате в магазине наличным путем или с
          помощью Kaspi.kz, назвать номер и дату Заказа.
        </p>
        <p>
          <b>8. Приемка Заказа</b><br /><br />8.1. При приемке Заказа Покупатель
          обязан:<br />8.1.1. Провести осмотр на предмет наличия внешнего
          повреждения упаковки.<br />8.1.2. Вскрыть в присутствии представителя
          службы доставки внешнюю упаковку с целью проверки сохранности
          содержимого упаковки, осмотреть Товар на предмет целостности его
          индивидуальной упаковки и наличия внешних повреждений на нем.
          Убедившись в сохранности упаковки и в отсутствии на ней следов
          вскрытия и внешних повреждений, открыть индивидуальную упаковку и
          проверить наличие в ней Товара. Убедившись в наличии Товара и
          отсутствии на нем следов механических повреждений, сверить артикул
          получаемого Товара с артикулом, проставленным в сопроводительном
          документе, проверить комплектацию и цвет Товара.<br />8.1.3. В случае
          отсутствия внешних повреждений упаковки и Товара, подписать
          сопроводительные документы, подтверждающие получении Заказа.<br />8.1.4.
          В случае наличия претензий потребовать от представителя службы
          доставки составить Акт приемки в 3-х экземплярах. В Акте приемки
          описываются все повреждения упаковки Товара, механические повреждения
          Товара и/или его некомплектность. Один экземпляр Акта приемки остается
          у Покупателя, два экземпляра у Продавца.<br />8.1.5. Если упаковка
          цела, а сам Товар имеет видимые повреждения или не доукомплектован,
          Покупатель указывает в Акте приемки информацию о том, что повреждений
          упаковки не обнаружено, но он отказывается от получения данного Товара
          и описывает повреждения/некомплектность товара. После этого
          представитель службы доставки Продавца забирает Товар для его
          последующей замены.
        </p>
        <p>
          <b>9. Ответственность сторон</b><br /><br />9.1. Продавец не несет
          ответственности за ущерб, причиненный Покупателю вследствие
          ненадлежащего использования Товаров, заказанных на Сайте.<br />9.2.
          Покупатель несет ответственность за достоверность и достаточность
          предоставленной при оформлении Заказа информации.<br />9.3. Стороны
          несут ответственность за исполнение обязательств по настоящему
          Договору в соответствии с Законом «О Защите прав потребителей»,
          Гражданским кодексом Республики Казахстан и другими
          нормативно-правовыми актами.<br />9.4. Стороны освобождаются от
          ответственности за полное или частичное неисполнение своих
          обязательств, если неисполнение является следствием таких
          непреодолимых обстоятельств как: война или военные действия,
          землетрясение, наводнение, пожар и другие стихийные бедствия, акты или
          действия органов государственной власти, изменение таможенных правил,
          ограничения импорта и экспорта, возникших независимо от воли Сторон
          после заключения настоящего Договора. Сторона, которая не может
          исполнить свои обязательства, незамедлительно извещает об этом другую
          Сторону и предоставляет документы, подтверждающие наличие таких
          обстоятельств, выданные уполномоченными на то органами.
        </p>
        <p>
          <b>10. Порядок рассмотрения претензий и разрешения споров</b
          ><br /><br />10.1. В случае возникновения вопросов и претензий со
          стороны Покупателя, он может обратиться по тел.+7 707 747 8212, кроме
          субботы.<br />10.2. При возникновении претензий относительно качества
          Товара, Покупатель вправе предъявить их в течение гарантийного срока
          на Товар в соответствии с Законом «О Защите прав потребителей».<br />10.3.
          Претензии относительно потери работоспособности Товара в ходе его
          эксплуатации в случаях, на которые распространяются гарантийные
          обязательства производителя Товара рассматриваются на основании
          заключений авторизованных сервисных центров. Адреса и телефоны
          авторизированных сервисных центров можно уточнить по тел.&nbsp; +7 707
          747 8212.<br />10.4. В случае обнаружения, что недостатки Товара
          возникли не по вине Продавца расходы по проведению экспертизы ложатся
          на Покупателя.<br />10.5. В случае выявления недостатков товара,
          возникших из-за дефектов изготовления или материалов (то есть,
          вследствие обстоятельств, за которые отвечает изготовитель) и при
          невозможности устранения этих недостатков Покупатель имеет право
          обменять товар или возвратить сумму, уплаченную за товар при
          предоставлении заключения авторизированного сервисного центра с
          указанием причин поломки товара, а также гарантийного талона,
          заполненного надлежащим образом и документа, подтверждающего оплату
          Товара через интернет-магазин.<br />10.6. При наличии законных
          оснований для обмена товара или возврата денежных средств Покупателю,
          возврат/обмен товара осуществляется в магазине, действующем под
          товарным знаком «Auto Security Service», расположенном по адресу:
          г.Алматы, ул.Щепеткова,122, тел. +7 707 747 8212<br />10.7. Продавец
          имеет право отказать в удовлетворении претензии по возвращаемому
          Товару надлежащего качества при отсутствии упаковки или при потере ее
          товарного вида, обнаружении внешних повреждений товара, несоответствии
          номеров на товаре, упаковке или гарантийном талоне.<br />10.8. При
          обмене или возврате Покупателем Товара надлежащего качества Продавец
          вправе требовать от Покупателя возмещения расходов, понесенных
          Продавцом при организации обмена или возврата Товара.<br />10.9.
          Стороны примут все меры к разрешению споров и разногласий, которые
          могут возникнуть при исполнении обязательств по Договору путем
          переговоров.<br />10.10. В случае если Стороны не пришли к соглашению,
          все споры подлежат рассмотрению в соответствии с действующим
          законодательством РК.
        </p>
        <p>
          <b>11. Конфиденциальность&nbsp;</b><br /><br />11.1. Продавец
          гарантирует, что никакая полученная от Покупателя информация никогда и
          ни при каких условиях не будет предоставлена третьим лицам, за
          исключением случаев, предусмотренных действующим законодательством
          Республики Казахстан.<br />11.2. Продавец может запросить у Покупателя
          предоставить личные сведения. Предоставленная информация используется
          исключительно при обработке Заказа в интернет-магазине или для
          предоставления Покупателю доступа к специальной информации. Личные
          сведения Покупатель может изменить, обновить или удалить.<br />11.3.
          Для обеспечения Покупателя информацией определенного рода, Продавец
          может присылать на указанный при регистрации адрес электронный почты
          информационные сообщения. В любой момент Покупатель может изменить
          тематику такой рассылки или отказаться от нее.<br />11.4. При оплате
          Заказа с помощью банковских карт информация о карточке и о ее
          держателе передается в защищенном виде на авторизационный сервер банка
          и не предоставляется Продавцу или третьим лицам. При этом никакая
          конфиденциальная информация, кроме уведомления об оплате в
          интернет-магазин Продавцу не передается.
        </p>
        <p>ПРОДАВЕЦ:</p>
        <p>
          "Auto Security Service"<br />Республика Казахстан, г. Алматы, ул.
          Щепеткова, 122<br />Валюта: KZT&nbsp;
        </p>
        <a :href="agreementFile" download="agreement.txt"
          >Скачать документ договора "Купли-продажи"</a
        >
      </div>
    </div>
  </section>
</template>
<script setup lang="ts">
import agreementFile from '/public/files/agreement.txt'
</script>
<style lang="scss">
.jshop {
  margin-top: 30px;
  padding: 10px;
  background-color: $white;
  border-radius: 15px;
  margin-bottom: 30px;
}
</style>
