<template>
  <section>
    <div class="container">
      <div class="jshop" id="comjshop">
        <h2>Политика Конфиденциальности</h2>
        <p>
          ЗАЯВЛЕНИЕ О КОНФИДЕНЦИАЛЬНОСТИ, УСЛОВИЯ СОГЛАШЕНИЯ
          И&nbsp;ПОЛЬЗОВАТЕЛЬСКОЕ СОГЛАШЕНИЕ
        </p>
        <p>
          Присоединяясь к настоящему Соглашению и оставляя свои данные на Сайте
          autosecurity.kz (далее – Сайт), путем заполнения полей форм обратной
          связи Пользователь:
        </p>
        <p>подтверждает, что все указанные им данные принадлежат лично ему,</p>
        <p>
          подтверждает и признает, что им внимательно в полном объеме прочитано
          Соглашение и условия обработки его персональных данных, указываемых им
          в полях форм обратной связи, текст соглашения и условия обработки
          персональных данных ему понятны;
        </p>
        <p>
          дает согласие на обработку Сайтом предоставляемых в составе информации
          персональных данных в целях заключения между ним и Сайтом настоящего
          Соглашения, а также его последующего исполнения;
        </p>
        <p>
          выражает согласие с условиями обработки персональных данных без
          оговорок и ограничений.
        </p>
        <p>
          Пользователь дает свое согласие на обработку его персональных данных,
          а именно совершение действий, предусмотренных соответствующим законом
          Республики Казахстан. Согласие Пользователя на обработку персональных
          данных является конкретным, информированным и сознательным.
        </p>
        <p>
          Настоящее согласие Пользователя признается исполненным в простой
          письменной форме, на обработку следующих персональных данных: фамилии,
          имени, отчества; года рождения; места пребывания (город, область);
          номеров телефонов; адресов электронной почты (E-mail).
        </p>
        <p>
          Пользователь, предоставляет autosecurity.kz право осуществлять
          следующие действия (операции) с персональными данными: сбор и
          накопление; хранение в течение установленных нормативными документами
          сроков хранения отчетности, но не менее трех лет, с момента даты
          прекращения пользования услуг Пользователем; уточнение (обновление,
          изменение); использование; уничтожение; обезличивание; передача по
          требованию суда, в т.ч., третьим лицам, с соблюдением мер,
          обеспечивающих защиту персональных данных от несанкционированного
          доступа.
        </p>
        <p>
          Указанное согласие действует бессрочно с момента предоставления данных
          и может быть отозвано Вами путем подачи заявления администрации сайта
          с указанием данных. Отзыв согласия на обработку персональных данных
          может быть осуществлен путем направления Пользователем
          соответствующего распоряжения в простой письменной форме на адрес
          электронной почты (E-mail) .
        </p>
        <p>
          Сайт не несет ответственности за использование (как правомерное, так и
          неправомерное) третьими лицами Информации, размещенной Пользователем
          на Сайте, включая её воспроизведение и распространение, осуществленные
          всеми возможными способами. Сайт имеет право вносить изменения в
          настоящее Соглашение. При внесении изменений в актуальной редакции
          указывается дата последнего обновления. Новая редакция Соглашения
          вступает в силу с момента ее размещения, если иное не предусмотрено
          новой редакцией Соглашения. Действующая редакция всегда находится на
          страницах сайта autosecurity.kz.<a href="https://dm.kg/"><br /></a>
        </p>
        <p>
          К настоящему Соглашению и отношениям между пользователем и Сайтом,
          возникающим в связи с применением Соглашения подлежит применению право
          Республики Казахстан.
        </p>
        <a :href="politicalFile" download="political.txt"
          >Скачать документ "Политика Конфиденциальности"</a
        >
      </div>
    </div>
  </section>
</template>
<script setup lang="ts">
import politicalFile from '/public/files/political.txt'
</script>
<style lang="scss">
.jshop {
  margin-top: 10px;
  padding: 10px;
  background-color: $white;
  border-radius: 15px;
}
</style>
